In [ ]:
import pandas as pd

Read salaries.csv as a dataframe called sal

In [ ]:
sal=pd.read_csv('/content/sample_data/Salaries.csv')

In [ ]:
sal

            Id       EmployeeName  ...         Agency  Status
0            1     NATHANIEL FORD  ...  San Francisco     NaN
1            2       GARY JIMENEZ  ...  San Francisco     NaN
2            3     ALBERT PARDINI  ...  San Francisco     NaN
3            4  CHRISTOPHER CHONG  ...  San Francisco     NaN
4            5    PATRICK GARDNER  ...  San Francisco     NaN
...        ...                ...  ...            ...     ...
148649  148650      Roy I Tillery  ...  San Francisco     NaN
148650  148651       Not provided  ...  San Francisco     NaN
148651  148652       Not provided  ...  San Francisco     NaN
148652  148653       Not provided  ...  San Francisco     NaN
148653  148654          Joe Lopez  ...  San Francisco     NaN

[148654 rows x 13 columns]

Check the head of the DataFrame.

In [ ]:
sal.head()

   Id       EmployeeName  ...         Agency  Status
0   1     NATHANIEL FORD  ...  San Francisco     NaN
1   2       GARY JIMENEZ  ...  San Francisco     NaN
2   3     ALBERT PARDINI  ...  San Francisco     NaN
3   4  CHRISTOPHER CHONG  ...  San Francisco     NaN
4   5    PATRICK GARDNER  ...  San Francisco     NaN

[5 rows x 13 columns]

Use the .info() method to find out how many entries there are.

In [ ]:
sal.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148045 non-null  float64
 4   OvertimePay       148650 non-null  float64
 5   OtherPay          148650 non-null  float64
 6   Benefits          112491 non-null  float64
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            0 non-null       float64
dtypes: float64(8), int64(2), object(3)
memory usage: 14.7+ MB

In [ ]:
sal['BasePay'].mean()    #AVERAGE BASEPAY

66325.44884050643

In [ ]:
test = sal['EmployeeName']
key = test[test=='JOSEPH DRISCOLL'].keys()[0]
title = sal['JobTitle']
title[key]


sal[sal['EmployeeName']=="JOSEPH DRISCOLL"]

    Id     EmployeeName  ...         Agency  Status
24  25  JOSEPH DRISCOLL  ...  San Francisco     NaN

[1 rows x 13 columns]

What is the job title of JOSEPH DRISCOLL ? Note: Use all caps, otherwise you may get an answer that doesn't match up (there is also a lowercase Joseph Driscoll).

In [ ]:
sal['OvertimePay'].max()

245131.88

What is the highest amount of OvertimePay in the dataset ?

In [ ]:
sal[sal['EmployeeName'] =='JOSEPH DRISCOLL']['JobTitle']

24    CAPTAIN, FIRE SUPPRESSION
Name: JobTitle, dtype: object

How much does JOSEPH DRISCOLL make (including benefits)?

In [ ]:
sal[sal['EmployeeName']=="JOSEPH DRISCOLL"]['TotalPayBenefits']

24    270324.91
Name: TotalPayBenefits, dtype: float64

What is the name of highest paid person (including benefits)?

In [ ]:
m=sal[sal['TotalPayBenefits'] == sal['TotalPayBenefits'].max()]
m

   Id    EmployeeName  ...         Agency  Status
0   1  NATHANIEL FORD  ...  San Francisco     NaN

[1 rows x 13 columns]

What is the name of lowest paid person (including benefits)? Do you notice something strange about how much he or she is paid?

In [ ]:
sal[sal['TotalPayBenefits']==sal['TotalPayBenefits'].min()]

What was the average (mean) BasePay of all employees per year? (2011-2014) ?

In [ ]:
sal.groupby('Year').mean()['BasePay']

Year
2011    63595.956517
2012    65436.406857
2013    69630.030216
2014    66564.421924
Name: BasePay, dtype: float64

In [ ]:
sal.groupby('Year').median()['BasePay']

Year
2011    62871.72
2012    64017.37
2013    67669.00
2014    65055.00
Name: BasePay, dtype: float64

How many unique job titles are there?

In [ ]:
sal['JobTitle'].nunique()

2159

What are the top 5 most common jobs?

In [ ]:
sal['JobTitle'].value_counts()[1:6]

Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Custodian                       2418
Name: JobTitle, dtype: int64

How many Job Titles were represented by only one person in 2013? (e.g. Job Titles with only one occurence in 2013?)

In [ ]:
thirteenJob = sal[sal['Year']==2013]
thirteenJob
oneJob = thirteenJob['JobTitle'].value_counts()
arr=oneJob[oneJob==1]
arr.size

202

How many people have the word Chief in their job title? (This is pretty tricky)

In [ ]:
sal[sal['JobTitle'].str.lower().str.contains('chief')]['JobTitle'].size

627

In [ ]:
def chief_string(title):
    if 'chief' in title.lower():
        return True
    else:
        return False

sum(sal['JobTitle'].apply(lambda x: chief_string(x)))

627

Bonus: Is there a correlation between length of the Job Title string and Salary?

In [ ]:
sal['title_len'] = sal['JobTitle'].str.len()
sal[['title_len','TotalPayBenefits']].corr()

                  title_len  TotalPayBenefits
title_len          1.000000         -0.036878
TotalPayBenefits  -0.036878          1.000000